Revit 2027 API
ParameterTypeId.SheetFilePath Property
 "File Path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SheetFilePath { get; }
Public Shared ReadOnly Property SheetFilePath As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SheetFilePath {
	ForgeTypeId^ get ();
}
static member SheetFilePath : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace